ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_can.c
/*********************************************************************************************************//**
 * @file    ht32f7xxxx_can.c
 * @version $Rev:: 398          $
 * @date    $Date:: 2025-11-05 #$
 * @brief   This file provides all the CAN firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f7xxxx_can.h"

/** @addtogroup HT32F7xxxx_Peripheral_Driver HT32F7xxxx Peripheral Driver
  * @{
  */

/** @defgroup CAN CAN
  * @brief CAN driver modules
  * @{
  */

/* Private types -------------------------------------------------------------------------------------------*/
typedef enum
{
  IF0_NUM = 0,
  IF1_NUM,
  IF_TOTAL_NUM
} CANIF_NUMBER_Enum;

/* Private function prototypes -----------------------------------------------------------------------------*/
static HT_CANIF_TypeDef *_GetFreeIF(HT_CAN_TypeDef  *CANx);
static void _CAN_EnterInitMode(HT_CAN_TypeDef *CANx);
static void _CAN_LeaveInitMode(HT_CAN_TypeDef *CANx);
static void _CAN_SetRxMsgObj(HT_CAN_TypeDef  *CANx, u32 MsgNum, CAN_MSG_TypeDef* pCanMsg, u32 uSingleOrFifoLast);
static s32 _CAN_ReadMsgObj(HT_CAN_TypeDef *CANx, u32 MsgNum, u32 Release, CAN_MSG_TypeDef* pCanMsg, u8* data, u32* len);
static ErrStatus _CAN_SetTxMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len);
static u32 _CAN_GetFreeMsgObj(HT_CAN_TypeDef *CANx);
static bool _CAN_GetNewData(HT_CAN_TypeDef *CANx, u32 MsgNum);
static bool _CAN_CheckMsgNumIsValid(u32 MsgNum);
static void _CAN_ClearMsgPendingFlag(HT_CAN_TypeDef *CANx, u32 MsgNum);
static void _CAN_MessageRAMInit(HT_CAN_TypeDef *CANx);

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup CAN_Exported_Functions CAN exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief  Deinitialize the specified CAN registers to their default values.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval None
 ************************************************************************************************************/
void CAN_DeInit(HT_CAN_TypeDef* CANx)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  if (CANx == HT_CAN0)
  {
    RSTCUReset.Bit.CAN0 = 1;
  }
  #if (LIBCFG_CAN1)
  else if (CANx == HT_CAN1)
  {
    RSTCUReset.Bit.CAN1 = 1;
  }
  #endif

  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief  Set CAN operation mode and target baud rate.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  CAN_InitStruct: pointer to a CAN_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void CAN_Init(HT_CAN_TypeDef* CANx, CAN_InitTypeDef* CAN_InitStruct)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_TSEG1(CAN_InitStruct->CAN_TSEG1));
  Assert_Param(IS_CAN_TSEG0(CAN_InitStruct->CAN_TSEG0));
  Assert_Param(IS_CAN_BRPRESCALER(CAN_InitStruct->CAN_BRPrescaler));
  Assert_Param(IS_CAN_SJW(CAN_InitStruct->CAN_SJW));
  Assert_Param(IS_CAN_MODE(CAN_InitStruct->CAN_Mode));

  _CAN_EnterInitMode(CANx);

  /* Initialize all Message Objects (1~32) in the Message RAM. */
  _CAN_MessageRAMInit(CANx);

  CANx->BTR = (((u32)(CAN_InitStruct->CAN_TSEG1      - 1) << CAN_BTR_TSEG1_Pos) & CAN_BTR_TSEG1_Msk)|
              (((u32)(CAN_InitStruct->CAN_TSEG0       -1) << CAN_BTR_TSEG0_Pos) & CAN_BTR_TSEG0_Msk)|
              (((u32)(CAN_InitStruct->CAN_BRPrescaler -1) << CAN_BTR_BRP_Pos)   & CAN_BTR_BRP_Msk)  |
              (((u32)(CAN_InitStruct->CAN_SJW         -1) << CAN_BTR_SJW_Pos)   & CAN_BTR_SJW_Msk);

  CANx->BRPER = (CAN_InitStruct->CAN_BRPrescaler >> 6) & CAN_BRPE_BRPE_Msk;

  if (CAN_InitStruct->CAN_NART)
    CANx->CR |= CAN_CR_DAR;
  else
    CANx->CR &= ~CAN_CR_DAR;

  if (CAN_InitStruct->CAN_Mode)
  {
    CAN_EnterTestMode(CANx, CAN_InitStruct->CAN_Mode);
  }
  CAN_IntConfig(CANx, CAN_INT_EIE | CAN_INT_IE , ENABLE);

  _CAN_LeaveInitMode(CANx);
}

/*********************************************************************************************************//**
 * @brief  Enable or Disable the specified CAN interrupt.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  CAN_Int: specify if the CAN interrupt source to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg CAN_INT_IE     : Module interrupt enable.
 *     @arg CAN_INT_SIE    : Status change interrupt enable.
 *     @arg CAN_INT_EIE    : Error interrupt enable.
 *     @arg CAN_INT_ALL    : All CAN interrupt
 * @param NewState: this parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CAN_IntConfig(HT_CAN_TypeDef *CANx, u32 CAN_Int, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_INT(CAN_Int));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  CAN_Int = CAN_Int & CAN_INT_ALL;

  if (NewState != DISABLE)
  {
    CANx->CR |= CAN_Int;
  }
   else
  {
    CANx->CR = CANx->CR & ~(CAN_Int);
  }
}

