ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_can.c
/*********************************************************************************************************//**
 * @brief  Get the specified CAN INT status.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  CAN_Int: the CAN interrupt source.
 *   This parameter can be one of the following values:
 *     @arg CAN_INT_IE     : Module interrupt enable.
 *     @arg CAN_INT_SIE    : Status change interrupt enable.
 *     @arg CAN_INT_EIE    : Error interrupt enable.
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus CAN_GetIntStatus(HT_CAN_TypeDef* CANx, u32 CAN_Int)
{
  FlagStatus Status;
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_INT(CAN_Int));

  if ((CANx->CR & CAN_Int) != RESET)
  {
    Status = SET;
  }
  else
  {
    Status = RESET;
  }
  return Status;
}

/*********************************************************************************************************//**
 * @brief  Get the interrupt flag of the specified CAN.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  CAN_Flag: specify the flag to be check.
 *   This parameter can be one of the following values:
 *     @arg CAN_FLAG_BOFF  : Busoff Status
 *     @arg CAN_FLAG_EWARN : Warning Status
 *     @arg CAN_FLAG_EPASS : Error Passive
 *     @arg CAN_FLAG_RXOK  : Received a Message Successfully
 *     @arg CAN_FLAG_TXOK  : Transmitted a Message Successfully
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus CAN_GetFlagStatus(HT_CAN_TypeDef* CANx, u32 CAN_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_FLAG(CAN_Flag));

  if (CANx->SR & CAN_Flag)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief  Clear the interrupt flag of the specified CAN.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  CAN_Flag: specify the flag that is to be cleared.
 *     @arg CAN_FLAG_RXOK  : Received a Message Successfully
 *     @arg CAN_FLAG_TXOK  : Transmitted a Message Successfully
 * @retval None
 ************************************************************************************************************/
void CAN_ClearFlag(HT_CAN_TypeDef* CANx, u32 CAN_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_FLAG(CAN_Flag));

  CANx->SR &= ~CAN_Flag;
}

/*********************************************************************************************************//**
 * @brief  Returns the CANx's last error code (LEC).
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval This function will return the CAN_ErrorCode following values:
 *    - NO_ERROR    : No Error
 *    - STUFF_ERROR : Stuff Error
 *    - FORM_ERROR  : Form Error
 *    - ACK_ERROR   : Acknowledgment Error
 *    - BIT1_EROR   : Bit Recessive Error
 *    - BIT0_ERROR  : Bit Dominant Error
 *    - CRC_ERROR   : CRC Error
 *    - NO_CHANGE   : Software Set Error
 ************************************************************************************************************/
CAN_LastErrorCode_TypeDef CAN_GetLastErrorCode(HT_CAN_TypeDef* CANx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  return (CAN_LastErrorCode_TypeDef)(CANx->SR & CAN_LEC_Msk);
}

/*********************************************************************************************************//**
 * @brief  Returns the CANx Receive Error Counter (REC).
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval CAN Receive Error Counter.
 ************************************************************************************************************/
u32 CAN_GetReceiveErrorCounter(HT_CAN_TypeDef* CANx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  return ((CANx->ECR & CAN_ECR_REC_Msk) >> CAN_ECR_REC_Pos);
}

/*********************************************************************************************************//**
 * @brief  Returns the the CANx Transmit Error Counter(TEC).
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval CAN Transmit Error Counter.
 ************************************************************************************************************/
u32 CAN_GetLSBTransmitErrorCounter(HT_CAN_TypeDef* CANx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  return (CANx->ECR & CAN_ECR_TEC_Msk);
}

/*********************************************************************************************************//**
 * @brief  Monitor CAN BusOff status.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval None
 ************************************************************************************************************/
void CAN_BusOffRecovery(HT_CAN_TypeDef *CANx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  /* Get BusOff Flag                                                                                        */
  if (CANx->SR & CAN_FLAG_BOFF)
  {
    _CAN_LeaveInitMode(CANx);
  }
  return;
}

/*********************************************************************************************************//**
 * @brief  Enter the CAN test mode.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  TestMask Specifies the configuration in test modes
 *         @arg CAN_MODE_BASIC              : Enable basic mode of test mode
 *         @arg CAN_MODE_SILENT             : Enable silent mode of test mode
 *         @arg CAN_MODE_LBACK              : Enable Loop Back Mode of test mode
 *         @arg CAN_MODE_MONITORER          : Sample Point can be monitored at CAN_TX pin.
 *         @arg CAN_MODE_TX_DOMINANT        : CAN_TX pin drives a dominant ('0') value
 *         @arg CAN_MODE_TX_RECESSIVE       : CAN_TX pin drives a recessive ('1') value
 * @retval None
 ************************************************************************************************************/
void CAN_EnterTestMode(HT_CAN_TypeDef *CANx, u32 TestMask)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_MODE(TestMask));

