ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_can.c
  CANx->CR |= CAN_CR_TEST;
  CANx->TR  = TestMask;
}

/*********************************************************************************************************//**
 * @brief  Leave the test mode
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval None
 ************************************************************************************************************/
void CAN_LeaveTestMode(HT_CAN_TypeDef *CANx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  CANx->CR |= CAN_CR_TEST;
  CANx->TR &= ~(CAN_MODE_LBACK | CAN_MODE_SILENT | CAN_MODE_BASIC | CAN_MODE_TX_RECESSIVE);
  CANx->CR &= (~CAN_CR_TEST);
}

/*********************************************************************************************************//**
 * @brief  The function is used to Send CAN message in BASIC mode of test mode. Before calling this API, the
 *         user should call CAN_EnterTestMode(CAN_MODE_BASIC) to let the CAN controller enter BASIC test mode.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the data buffer to be transmitted.
 * @param  len: Length of the data to be transmitted.
 * @retval SUCCESS or ERROR
 ************************************************************************************************************/
ErrStatus CAN_BasicSendMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_MSG_ID(pCanMsg->Id));
  Assert_Param(IS_CAN_MSG_MASK(pCanMsg->IdMask));

  if (CANx->SR & CAN_FLAG_BOFF)
  {
    return ERROR;
  }
  while (CANx->IF0.CREQ & CAN_FLAG_IF_BUSY)
  {
  }

  if (pCanMsg->IdType == CAN_STD_ID)
  {
    /* standard ID                                                                                          */
    CANx->IF0.ARB0 = 0;
    CANx->IF0.ARB1 = (((pCanMsg->Id) & CAN_STD_FRAME_Msk) << 2);
  }
  else
  {
    /* extended ID                                                                                          */
    CANx->IF0.ARB0 = (pCanMsg->Id)          & CAN_EXT_FRAME_LSB_Msk;
    CANx->IF0.ARB1 = (((pCanMsg->Id) >> 16) & CAN_EXT_FRAME_MSB_Msk) | CAN_IF_ARB1_XTD;
  }

  if (pCanMsg->FrameType)
    CANx->IF0.ARB1 |= CAN_IF_ARB1_DIR;
  else
    CANx->IF0.ARB1 &= (~CAN_IF_ARB1_DIR);

  CANx->IF0.MCR  = (CANx->IF0.MCR & (~CAN_IF_MCR_DLC_Msk)) | len;

  /* Write data[] into CAN data registers (DA0R~DB1R) */
  {
    int i = 0,j = 0;
    u32 *pReg = (u32*)&CANx->IF0.DA0R;

    while ((i < len) && (j < 4))
    {
      u16 regVal = data[i++];
      if (i < len)
      {
          regVal |= data[i++] << 8;
      }
      pReg[j++] = (u32)regVal;
    }
  }

  /* request transmission                                                                                   */
  CANx->IF0.CREQ &= (~CAN_FLAG_IF_BUSY);
  if (CANx->IF0.CREQ & CAN_FLAG_IF_BUSY)
  {
    return ERROR;
  }

  CANx->IF0.CREQ |= CAN_FLAG_IF_BUSY; /* Sending                                                            */

  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Receives a CAN message in BASIC test mode. Before calling this API, the user should call
 *         CAN_EnterTestMode(CAN_MODE_BASIC) to let the CAN controller enter BASIC test mode.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the buffer where received data will be stored.
 * @param  len: Pointer to a variable that will store the length of the received data.
 * @retval Returns the status of the message reception. Possible values are:
 *    - MSG_RX_FINISH
 *    - MSG_NOT_RECEIVED
 *    - MSG_OVER_RUN
 ************************************************************************************************************/
CAN_RxStatus_TypeDef CAN_BasicReceiveMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8* len)
{
  CAN_RxStatus_TypeDef status = MSG_NOT_RECEIVED;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_MSG_ID(pCanMsg->Id));
  Assert_Param(IS_CAN_MSG_MASK(pCanMsg->IdMask));

  if ((CANx->IF1.MCR & CAN_IF_MCR_NEWDAT) == 0)   /* In basic mode, receive data always save in IF1         */
  {
      return status;
  }

  if ((CANx->IF1.ARB1 & CAN_IF_ARB1_XTD) == 0)
  {
    /* standard ID                                                                                          */
    pCanMsg->IdType = CAN_STD_ID;
    pCanMsg->Id     = (CANx->IF1.ARB1 >> 2) & CAN_STD_FRAME_Msk;
  }
  else
  {
    /* extended ID                                                                                          */
    pCanMsg->IdType = CAN_EXT_ID;
    pCanMsg->Id     = (CANx->IF1.ARB1 & CAN_EXT_FRAME_MSB_Msk) << 16;
    pCanMsg->Id    |= (u32)CANx->IF1.ARB0;
  }

  *len = CANx->IF1.MCR & CAN_IF_MCR_DLC_Msk;

  /* Read from CAN data registers (DA0R~DB1R) into data[] */
  {
    int i=0, j=0;
    u32 *pReg = (u32*)&CANx->IF1.DA0R;

    while ((i < *len) && (j < 4))
    {
      u16 regVal = (u16)pReg[j++];
      data[i++] = (u8)(regVal & 0xFF);
      if (i < *len)
      {
        data[i++] = (u8)((regVal >> 8) & 0xFF);
      }
    }
  }

  CANx->IF1.MCR  &= ~(CAN_IF_MCR_NEWDAT);
  if ((CANx->IF1.MCR & CAN_IF_MCR_MSGLST) > 0)
  {
    CANx->IF1.MCR  &= ~(CAN_IF_MCR_MSGLST);
    status =  MSG_OVER_RUN;
  }
  else
  {
    status =  MSG_RX_FINISH;
  }
  return status;
}

/*********************************************************************************************************//**
 * @brief  Send CAN message.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the data buffer to be transmitted.
 * @param  len: Length of the data to be transmitted.
 * @retval SUCCESS or ERROR
 ************************************************************************************************************/
ErrStatus CAN_Transmit(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_MSG_ID(pCanMsg->Id));
  Assert_Param(IS_CAN_MSG_MASK(pCanMsg->IdMask));

  if (_CAN_SetTxMsg(CANx, pCanMsg, data, len) == ERROR)
  {
    return ERROR;
  }
  return (CAN_TriggerTxMsg(CANx, pCanMsg));
}

