ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_can.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_MSG_ID(pCanMsg->Id));
  Assert_Param(IS_CAN_MSG_MASK(pCanMsg->IdMask));

  if (_CAN_CheckMsgNumIsValid(pCanMsg->MsgNum) == FALSE)
  {
    return FALSE;
  }

  Pending  = CANx->IPR0;
  Pending |= (CANx->IPR1 << 16);
  if ((Pending & 1 << (pCanMsg->MsgNum - 1)) == 0)
  {
    return FALSE;
  }
  return TRUE;
}

/*********************************************************************************************************//**
 * @brief  Clear interrupt pending bit.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @retval SUCCESS or ERROR
 ************************************************************************************************************/
ErrStatus CAN_ClearMsgPendingFlag(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_MSG_ID(pCanMsg->Id));
  Assert_Param(IS_CAN_MSG_MASK(pCanMsg->IdMask));

  if (_CAN_CheckMsgNumIsValid(pCanMsg->MsgNum) == FALSE)
  {
    return ERROR;
  }

  _CAN_ClearMsgPendingFlag(CANx, pCanMsg->MsgNum);

  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Checks the transmission of a message object.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @retval 1: Successful, 0: Transmitting, -1: Failed (CAN_TriggerTxMsg must be called to retransmit).
 ************************************************************************************************************/
s32 CAN_TransmitStatus(HT_CAN_TypeDef* CANx, CAN_MSG_TypeDef* pCanMsg)
{
  s32 TxStatus = 0;
  u32 u32Reg;
  s32 MsgNum = pCanMsg->MsgNum -1;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_MSG_ID(pCanMsg->Id));
  Assert_Param(IS_CAN_MSG_MASK(pCanMsg->IdMask));

  if (_CAN_CheckMsgNumIsValid(pCanMsg->MsgNum) == FALSE)
  {
    return -1;
  }

  u32Reg  = CANx->TRR0;
  u32Reg |= (CANx->TRR1 << 16);
  MsgNum  = 1 << (MsgNum);
  if ((u32Reg & (MsgNum)) == 0)
  {
    u32Reg  = CANx->NDR0;
    u32Reg |= (CANx->NDR1 << 16);
    if ((u32Reg & (MsgNum)) > 0)
    {
      if((CANx->SR & CAN_LEC_Msk) != NO_ERROR)
      {
        CANx->SR &= ~CAN_LEC_Msk; /* Clear LEC */
        TxStatus = -1; /* Failed */
      }
    }
    else
    {
      TxStatus = 1;    /* Successful */
    }
  }
  return TxStatus;
}

/*********************************************************************************************************//**
 * @brief  Updates the data of a specified CAN message object.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the data array.
 * @param  len: Length of the data to be sent, in bytes (maximum 8 bytes).
 * @retval SUCCESS or ERROR
 ************************************************************************************************************/
ErrStatus CAN_UpdateTxMsgData(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len)
{
  HT_CANIF_TypeDef *IFx = NULL;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_MSG_ID(pCanMsg->Id));
  Assert_Param(IS_CAN_MSG_MASK(pCanMsg->IdMask));

  len &= CAN_IF_MCR_DLC_Msk;

  if (_CAN_CheckMsgNumIsValid(pCanMsg->MsgNum) == FALSE)
  {
    return ERROR;
  }

  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }

  IFx->CMASK = CAN_IF_CMASK_CONTROL;
  IFx->CREQ = pCanMsg->MsgNum;
  /* Wait until IFx is ready */
  while (IFx->CREQ & CAN_FLAG_IF_BUSY)
  {
  }

  IFx->CMASK = CAN_IF_CMASK_WRRD | CAN_IF_CMASK_DATAA | CAN_IF_CMASK_DATAB | CAN_IF_CMASK_CONTROL;

  IFx->MCR &= (~CAN_IF_MCR_DLC_Msk);
  IFx->MCR |= (len & CAN_IF_MCR_DLC_Msk);

  /* Write data[] into CAN data registers (DA0R~DB1R) */
  {
    int i = 0,j = 0;
    u32 *pReg = (u32*)&IFx->DA0R;

    while ((i < len) && (j < 4))
    {
      u16 regVal = data[i++];
      if (i < len)
      {
          regVal |= data[i++] << 8;
      }
      pReg[j++] = (u32)regVal;
    }
  }

  IFx->CREQ = pCanMsg->MsgNum;
  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Set transmit request bit.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @retval SUCCESS or ERROR
 ************************************************************************************************************/
ErrStatus CAN_TriggerTxMsg(HT_CAN_TypeDef  *CANx, CAN_MSG_TypeDef* pCanMsg)
{
  HT_CANIF_TypeDef *IFx = NULL;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_MSG_ID(pCanMsg->Id));
  Assert_Param(IS_CAN_MSG_MASK(pCanMsg->IdMask));

  if (CANx->SR & CAN_FLAG_BOFF)
  {
    return ERROR;
  }

  if (_CAN_CheckMsgNumIsValid(pCanMsg->MsgNum) == FALSE)
  {
    return ERROR;
  }

  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }
  IFx->CMASK = CAN_IF_CMASK_CONTROL;
  IFx->CREQ = pCanMsg->MsgNum;
  /* Wait until IFx is ready */
  while (IFx->CREQ & CAN_FLAG_IF_BUSY)
  {
  }

  IFx->CMASK = CAN_IF_CMASK_WRRD | CAN_IF_CMASK_CONTROL;
  IFx->MCR  |= CAN_IF_MCR_NEWDAT | CAN_IF_MCR_TXRQST;
  IFx->CREQ  = pCanMsg->MsgNum;

  return SUCCESS;
}

