ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_can.c
/*********************************************************************************************************//**
 * @brief  Clears all pending message flags.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval None
 ************************************************************************************************************/
void CAN_ClearAllMsgPendingFlag(HT_CAN_TypeDef *CANx)
{
  int i;
  u32 Pending =  CANx->IPR0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  Pending    |=  CANx->IPR1 << 16;
  for (i = 0 ; i < MSG_OBJ_TOTAL_NUM ; i++)
  {
    if ((Pending & 1) == 1)
    {
      _CAN_ClearMsgPendingFlag(CANx, i + 1);
    }

    Pending = Pending >> 1;
    if (Pending == 0)
    {
      break;
    }
  }
}

/*********************************************************************************************************//**
 * @brief  Enable or disable automatic transmission when a Remote Frame is received.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  NewState: This parameter can be ENABLE or DISABLE.
 * @retval SUCCESS or ERROR
 ************************************************************************************************************/
ErrStatus CAN_RemoteFrameAutoReplyCmd(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, ControlStatus NewState)
{
  HT_CANIF_TypeDef *IFx = NULL;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  Assert_Param(IS_CAN_MSG_ID(pCanMsg->Id));
  Assert_Param(IS_CAN_MSG_MASK(pCanMsg->IdMask));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (_CAN_CheckMsgNumIsValid(pCanMsg->MsgNum) == FALSE)
  {
    return ERROR;
  }

  /* Get a free CAN interface to read current MCR settings */
  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }

  /* Request to read the CONTROL register (MCR) of the specified message object */
  IFx->CMASK = CAN_IF_CMASK_CONTROL;
  IFx->CREQ  = pCanMsg->MsgNum;

  /* Waiting CAN interface free */
  while (IFx->CREQ & CAN_FLAG_IF_BUSY)
  {
  }

  /* Request to write to CONTROL register (MCR) */
  IFx->CMASK = CAN_IF_CMASK_WRRD | CAN_IF_CMASK_CONTROL;

  /* Set or clear RMTEN based on NewState */
  if (NewState == ENABLE)
  {
    IFx->MCR |= CAN_IF_MCR_RMTEN;
  }
  else
  {
    IFx->MCR &= ~CAN_IF_MCR_RMTEN;
  }

  /* Apply the updated MCR value to the specified message object */
  IFx->CREQ = pCanMsg->MsgNum;

  return SUCCESS;
}

/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup CAN_Private_Functions CAN private functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief  The function is used to configure a transmit object.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the data buffer to be transmitted.
 * @param  len: Length of the data to be transmitted.
 * @retval SUCCESS or ERROR
 ************************************************************************************************************/
ErrStatus _CAN_SetTxMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len)
{
  HT_CANIF_TypeDef *IFx = NULL;

  if (pCanMsg->MsgNum == 0)
  {
    pCanMsg->MsgNum = _CAN_GetFreeMsgObj(CANx);
  }
  if (pCanMsg->MsgNum > MSG_OBJ_TOTAL_NUM)
  {
    return ERROR;
  }

  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }

  /* update the contents needed for transmission                                                            */
  IFx->CMASK = CAN_IF_CMASK_WRRD | CAN_IF_CMASK_MASK | CAN_IF_CMASK_ARB
             | CAN_IF_CMASK_CONTROL | CAN_IF_CMASK_DATAA | CAN_IF_CMASK_DATAB;

  if (pCanMsg->IdType == CAN_STD_ID)
  {
    /* standard ID                                                                                          */
    IFx->ARB0 = 0;
    IFx->ARB1 = (((pCanMsg->Id) & CAN_STD_FRAME_Msk) << 2) | CAN_IF_ARB1_DIR | CAN_IF_ARB1_MSGVAL;
  }
  else
  {
    /* extended ID                                                                                          */
    IFx->ARB0 = pCanMsg->Id & CAN_EXT_FRAME_LSB_Msk;
    IFx->ARB1 = ((pCanMsg->Id >> 16) & CAN_EXT_FRAME_MSB_Msk)
              | CAN_IF_ARB1_DIR | CAN_IF_ARB1_XTD | CAN_IF_ARB1_MSGVAL;
  }

  if (pCanMsg->FrameType)
    IFx->ARB1 |= CAN_IF_ARB1_DIR;
  else
    IFx->ARB1 &= (~CAN_IF_ARB1_DIR);

  IFx->MASK0 = CAN_IF_MASK0_MSK_Msk;
  IFx->MASK1 = CAN_IF_MASK1_MSK_Msk | CAN_IF_MASK1_MXTD | CAN_IF_MASK1_MDIR;

  /* NEWDAT = 0, MSGLST = 0, INTPND = 0, UMASK=0, TXIE = 1, RXIE = 0, RMTEN = 0, TXRQST = 0, EOB = 1 */
  IFx->MCR   = len | CAN_IF_MCR_TXIE | CAN_IF_MCR_EOB ;

  /* Write data[] into CAN data registers (DA0R~DB1R) */
  {
    int i = 0,j = 0;
    u32 *pReg = (u32*)&IFx->DA0R;

    while ((i < len) && (j < 4))
    {
      u16 regVal = data[i++];
      if (i < len)
      {
          regVal |= data[i++] << 8;
      }
      pReg[j++] = (u32)regVal;
    }
  }

  IFx->CREQ = pCanMsg->MsgNum;

  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Get the new data status of a message object.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  MsgNum: Specifies the Message object number, from 1 to 32.
 * @retval TRUE: The corresponding message object has a new data bit is set, FALSE otherwise.
 ************************************************************************************************************/
bool _CAN_GetNewData(HT_CAN_TypeDef *CANx, u32 MsgNum)
{
  u32 NewData = CANx->NDR0;

  NewData    |= CANx->NDR1 << 16;

  if ((NewData & 1 << (MsgNum - 1)) == 0)
  {
    return FALSE;
  }
  return TRUE;
}

