ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_can.c
/*********************************************************************************************************//**
 * @brief  Get free interface.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval Free IF pointer. NULL: No IF is free
 ************************************************************************************************************/
static HT_CANIF_TypeDef *_GetFreeIF(HT_CAN_TypeDef  *CANx)
{
  if ((CANx->IF0.CREQ & CAN_FLAG_IF_BUSY) == 0)
  {
    return &CANx->IF0;
  }
  else if ((CANx->IF1.CREQ & CAN_FLAG_IF_BUSY) == 0)
  {
    return &CANx->IF1;
  }
  else
  {
    return NULL;
   }
}

/*********************************************************************************************************//**
 * @brief  This function is used to set CAN to enter initialization mode and enable access bit timing
 *         register. After bit timing configuration ready, user must call CAN_LeaveInitMode() to leave
 *         initialization mode and lock bit timing register to let new configuration take effect.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval None
 ************************************************************************************************************/
static void _CAN_EnterInitMode(HT_CAN_TypeDef *CANx)
{
  CANx->CR |= (CAN_CR_INIT | CAN_CR_CCE);
}

/*********************************************************************************************************//**
 * @brief  Leave initialization mode
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval None
 ************************************************************************************************************/
static void _CAN_LeaveInitMode(HT_CAN_TypeDef *CANx)
{
  CANx->CR &= (~(CAN_CR_INIT | CAN_CR_CCE));

  while (CANx->CR & CAN_CR_INIT); /* Check INIT bit is released                                             */
}

/*********************************************************************************************************//**
 * @brief  Set Rx message object
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  MsgNum: Specifies the Message object number, from 1 to 32.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  uSingleOrFifoLast: Specifies the end-of-buffer indicator.
 * @retval None
 ************************************************************************************************************/
static void _CAN_SetRxMsgObj(HT_CAN_TypeDef  *CANx, u32 MsgNum, CAN_MSG_TypeDef* pCanMsg, u32 uSingleOrFifoLast)
{
  HT_CANIF_TypeDef *IFx = NULL;

  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }
  /* Command Setting                                                                                        */
  IFx->CMASK = CAN_IF_CMASK_WRRD | CAN_IF_CMASK_MASK | CAN_IF_CMASK_ARB |
               CAN_IF_CMASK_CONTROL;

  if (pCanMsg->IdType == CAN_STD_ID) /* According STD/EXT ID format, Configure Mask and Arb. register.      */
  {
    /* Standard Mask.(bit28..bit18).                                                                        */
    IFx->ARB0  = 0;
    IFx->ARB1  = CAN_IF_ARB1_MSGVAL | (pCanMsg->Id     & CAN_STD_FRAME_Msk) << 2;
    IFx->MASK0 = 0;
    IFx->MASK1 = CAN_IF_MASK1_MDIR  | (pCanMsg->IdMask & CAN_STD_FRAME_Msk) << 2;
  }
  else
  {
    IFx->ARB0  = pCanMsg->Id & CAN_EXT_FRAME_LSB_Msk;
    IFx->ARB1  = CAN_IF_ARB1_MSGVAL | CAN_IF_ARB1_XTD   | ((pCanMsg->Id >> 16) & CAN_EXT_FRAME_MSB_Msk);
    IFx->MASK0 = pCanMsg->IdMask & CAN_IF_MASK0_MSK_Msk;
    IFx->MASK1 = CAN_IF_MASK1_MXTD  | CAN_IF_MASK1_MDIR | ((pCanMsg->IdMask>> 16) & CAN_IF_MASK1_MSK_Msk);
  }

  /* NEWDAT = 0, MSGLST = 0, INTPND = 0, UMASK=1, TXIE = 0, RXIE = 1, RMTEN = 0, TXRQST = 0, EOB = appl. */
  IFx->MCR = CAN_IF_MCR_RXIE | CAN_IF_MCR_UMASK;
  if (uSingleOrFifoLast)
    IFx->MCR |= CAN_IF_MCR_EOB;

  if (pCanMsg->FrameType == CAN_REMOTE_FRAME)
  {
    IFx->ARB1 |= CAN_IF_ARB1_DIR;
  }

  IFx->CREQ = MsgNum;
}

/*********************************************************************************************************//**
 * @brief  Gets the message
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  MsgNum: Specifies the Message object number, from 1 to 32.
 * @param  Release: Specifies the message release indicator.
 *         @arg TRUE : the message object is released when getting the data.
 *         @arg FALSE: the message object is not released.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the buffer where received data will be stored.
 * @param  len: Pointer to a variable that will store the length of the received data.
 * @retval  0: Data not empty, 1: Finish, 2: data over run
 ************************************************************************************************************/
static s32 _CAN_ReadMsgObj(HT_CAN_TypeDef *CANx, u32 MsgNum, u32 Release, CAN_MSG_TypeDef* pCanMsg, u8* data, u32* len)
{
  HT_CANIF_TypeDef *IFx = NULL;

  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }

  /* read the message contents                                                                              */
  IFx->CMASK = CAN_IF_CMASK_MASK
             | CAN_IF_CMASK_ARB
             | CAN_IF_CMASK_CONTROL
             | CAN_IF_CMASK_CLRINTPND
             | (Release ? CAN_IF_CMASK_TXRQSTNEWDAT : 0)
             | CAN_IF_CMASK_DATAA
             | CAN_IF_CMASK_DATAB;

  IFx->CREQ = MsgNum;

  while (IFx->CREQ & CAN_FLAG_IF_BUSY)
  {
    /*Wait                                                                                                  */
  }

  if ((IFx->ARB1 & CAN_IF_ARB1_XTD) == 0)
  {
    /* standard ID                                                                                          */
    pCanMsg->Id = (IFx->ARB1 & CAN_IF_ARB1_ID_Msk) >> 2;
  }
  else
  {
    /* extended ID                                                                                          */
    pCanMsg->Id  = (IFx->ARB1 & CAN_EXT_FRAME_MSB_Msk) << 16;
    pCanMsg->Id |= IFx->ARB0;
  }
  if ((IFx->MCR & CAN_IF_MCR_RMTEN) == 0)
  {
    pCanMsg->FrameType = CAN_DATA_FRAME;
  }
  else
  {
    pCanMsg->FrameType = CAN_REMOTE_FRAME;
  }
  *len = IFx->MCR & CAN_IF_MCR_DLC_Msk;

  /* Read from CAN data registers (DA0R~DB1R) into data[] */
  {
    int i=0, j=0;
    u32 *pReg = (u32*)&IFx->DA0R;

    while ((i < *len) && (j < 4))
    {
      u16 regVal = (u16)pReg[j++];
      data[i++]  = (u8)(regVal & 0xFF);
      if (i < *len)
      {
        data[i++] = (u8)((regVal >> 8) & 0xFF);
      }
    }
  }

