ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_can.c
  if ((IFx->MCR & CAN_IF_MCR_MSGLST) > 0)
  {
    IFx->CMASK = CAN_IF_CMASK_WRRD | CAN_IF_CMASK_CONTROL;
    IFx->MCR  &= ~(CAN_IF_MCR_MSGLST| CAN_IF_MCR_NEWDAT|CAN_IF_MCR_INTPND);
    IFx->CREQ  = MsgNum;
    return 2;
  }
  if ((IFx->MCR & CAN_IF_MCR_EOB) > 0)
  {
    return 1;
  }
  else
  {
    return 0;
  }
}

/*********************************************************************************************************//**
 * @brief  Get the first valid message object number from the CAN message valid registers (MVR0 and MVR1).
 *         This function scans through the message object table to find the first valid message object that is
 *         not set (i.e., where the corresponding bit in the message valid register is 0).
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval The index of the first valid message object that is not set.
 ************************************************************************************************************/
static u32 _CAN_GetFreeMsgObj(HT_CAN_TypeDef *CANx)
{
  s32 _MsgNum;
  u32 msgNumTable = CANx->MVR0;

  msgNumTable |=  CANx->MVR1 << 16;
  for (_MsgNum = 0 ; _MsgNum < MSG_OBJ_TOTAL_NUM ; _MsgNum++)
  {
    if ((msgNumTable & 1) == 0)
    {
      break;
    }
    msgNumTable = msgNumTable >> 1;
  }
  return _MsgNum + 1;
}

/*********************************************************************************************************//**
 * @brief  Checks if the specified message number is valid.
 * @param  MsgNum: The message number.
 * @retval TRUE if the message number is valid, FALSE otherwise.
 ************************************************************************************************************/
static bool _CAN_CheckMsgNumIsValid(u32 MsgNum)
{
  if ((MsgNum == 0) || (MsgNum > MSG_OBJ_TOTAL_NUM))
  {
    return FALSE;
  }
  return TRUE;
}

/*********************************************************************************************************//**
 * @brief  Clear interrupt pending bit.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  MsgNum: The message number.
 * @retval None.
 ************************************************************************************************************/
static void _CAN_ClearMsgPendingFlag(HT_CAN_TypeDef *CANx, u32 MsgNum)
{
  HT_CANIF_TypeDef *IFx = NULL;

  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }
  IFx->CMASK = CAN_IF_CMASK_CLRINTPND;
  IFx->CREQ = MsgNum;
}

/*********************************************************************************************************//**
 * @brief  Initializes all CAN message objects in the Message RAM.
 *         This function iterates through all available message objects and resets their mask, control,
 *         arbitration, and relevant registers to default values. It also performs necessary RAM
 *         initialization to ensure all message objects are disabled and in a known safe state before CAN
 *         communication starts. Typically called during CAN peripheral initialization to prevent unintended
 *         message reception or transmission.
 * @param  CANx: Pointer to the CAN peripheral (HT_CAN_TypeDef).
 * @retval None
 ************************************************************************************************************/
static void _CAN_MessageRAMInit(HT_CAN_TypeDef *CANx)
{
  int i;
  HT_CANIF_TypeDef *IFx = NULL;

  for ( i=1; i<= MSG_OBJ_TOTAL_NUM; i++)
  {
    IFx = NULL;
    while (IFx == NULL)
    {
      IFx = _GetFreeIF(CANx);
    }
    IFx->CMASK = CAN_IF_CMASK_MASK | CAN_IF_CMASK_CONTROL | CAN_IF_CMASK_WRRD | CAN_IF_CMASK_ARB;
    IFx->MASK0 = 0xFFFF;
    IFx->MASK1 = 0xFFFF;
    IFx->ARB1  = 0;
    IFx->MCR   = 0;
    IFx->CREQ  = i;
  }

  /* Wait until the last message object initialization request is completed */
  while (IFx->CREQ & CAN_FLAG_IF_BUSY)
  {
  }
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
